D = {
    "增生腺体": {
        "增生_侧别": {},
        "增生_表现": {}
    },
    "导管": {
        "导管_侧别": {},
        "导管_表现": {}
    },
    "病灶": {
        "病灶_侧别": {},
        "病灶_象限": {},
        "病灶_钟面": {},
        "病灶_评估分类": {},
        "病灶_回声强度": {},

    },
    "腋窝": {
        "腋窝_侧别": {},
        "腋窝_淋巴结表现": {},
        "腋窝_评估分类": {}
    },
    "锁骨上侧": {
        "锁骨上侧_侧别": {},
        "锁骨上_淋巴结表现": {},
        "锁骨上_评估分类": {}
    },
    "锁骨下侧": {
        "锁骨下_侧别": {},
        "锁骨下_淋巴结表现": {},
        "锁骨下_评估分类": {}
    },
    "内乳": {
        "内乳_侧别": {},
        "内乳_淋巴结表现": {},
        "内乳_评估分类": {}
    }
}
# # D["科比"] = "mvp"
# #
# # D["内乳"]["曼巴"] ="champion"
# # d = D["内乳"]
# # print(d)
# # d["内乳_评估分类"]["new_key"] = [1,23,4]
# # D["内乳"]["内乳_评估分类"]["index"] = 123
# #
# # # print(d)
# # print(D)
#
# dict_new = {"key1":123,"key2":"中文word","key3":{}}
# # dict_new["key3"]= "kd"
# dict_new["key3"]["name"]= "kd"
#
# # dict_sub = dict_new["key3"]
# #
# # dict_sub["sub_key1"] = 456
# #
# print(dict_new)
# # print(dict_sub)

{"增生腺体": {"增生_侧别": {}, "增生_表现": {}}, "导管": {"导管_侧别": {}, "导管_表现": {}}, "病灶": {"病灶_侧别": {"entity": "左", "label": "侧别", "idx": [2, 3]}, "病灶_象限": {"entity": "外上象限", "label": "象限定位", "idx": [4, 8]}, "病灶_钟面": {}, "病灶_评估分类": {"entity": "BI-RADS:5类", "label": "BI-RADS分类_超声", "idx": [17, 27]}, "病灶_回声强度": {}}, "腋窝": {"腋窝_侧别": {"entity": "双侧", "label": "侧别", "idx": [49, 51]}, "腋窝_淋巴结表现": {"entity": "未见明显肿大淋巴结", "label": "淋巴结表现", "idx": [53, 62]}, "腋窝_评估分类": {}}, "锁骨上侧": {"锁骨上侧_侧别": {}, "锁骨上_淋巴结表现": {}, "锁骨上_评估分类": {}}, "锁骨下侧": {"锁骨下_侧别": {}, "锁骨下_淋巴结表现": {}, "锁骨下_评估分类": {}}, "内乳": {"内乳_侧别": {}, "内乳_淋巴结表现": {}, "内乳_评估分类": {}}, "病灶2": {"病灶_侧别": {"entity": "右", "label": "侧别", "idx": [30, 31]}, "病灶_象限": {"entity": "内上象限", "label": "象限定位", "idx": [32, 36]}, "病灶_钟面": {}, "病灶_评估分类": {"entity": "BI-RADS2类", "label": "BI-RADS分类_超声", "idx": [37, 46]}, "病灶_回声强度": {}}}
